# Задача 22: Даны два неупорядоченных набора целых чисел (может быть, с повторениями).
# Выдать без повторений в порядке возрастания все те числа, которые встречаются в обоих наборах.
# Пользователь вводит 2 числа. n — кол-во элементов первого множества. 
# m — кол-во элементов второго множества. Затем пользователь вводит сами элементы множеств.

# from random import randint

# my_list1 = [randint(0, 10) for i in range(10)]
# print(my_list1)

# my_list2 = [randint(0, 10) for i in range(8)]
# print(my_list2)

# my_list3 = []

# for i in my_list1:
#     for j in my_list2:
#         if i == j:
#             my_list3.append(i)
#             break
# print(my_list3)

# my_set = set(my_list3)
# New_List=list(my_set)

# print("Уникальным значениями в списке {0} являются".format(my_list3))

# for i in New_List:
#   print(i)

# ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
            
 
